In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time

In [2]:
file_to_load = "../Resources/Copy of MSA_M2018_dl.csv"

In [3]:
df = pd.read_csv(file_to_load)
df.head()

,PRIM_STATE,AREA,AREA_NAME,OCC_CODE,OCC_TITLE,OCC_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC QUOTIENT,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,AK,11260,"Anchorage, AK",00-0000,All Occupations,total,"171,770",1.1,1000.000,1.00,...,22.68,35.82,51.21,"23,740","31,070","47,170","74,510","106,510",NaN,NaN
1,AK,11260,"Anchorage, AK",11-0000,Management Occupations,major,"10,610",2.5,61.779,1.17,...,48.94,64.70,93.24,"55,490","74,950","101,800","134,580","193,930",NaN,NaN
2,AK,11260,"Anchorage, AK",11-1011,Chief Executives,detailed,400,8.7,2.307,1.71,...,78.04,#,#,"85,730","119,660","162,320",#,#,NaN,NaN
3,AK,11260,"Anchorage, AK",11-1021,General and Operations Managers,detailed,"3,630",4.2,21.157,1.34,...,50.10,71.35,#,"55,190","74,860","104,210","148,400",#,NaN,NaN
4,AK,11260,"Anchorage, AK",11-1031,Legislators,detailed,50,1.3,0.293,0.84,...,*,*,*,"20,690","27,640","51,130","51,140","51,140",True,NaN

In [4]:
df.dtypes

PRIM_STATE      object
AREA             int64
AREA_NAME       object
OCC_CODE        object
OCC_TITLE       object
OCC_GROUP       object
TOT_EMP         object
EMP_PRSE        object
JOBS_1000       object
LOC QUOTIENT    object
H_MEAN          object
A_MEAN          object
MEAN_PRSE       object
H_PCT10         object
H_PCT25         object
H_MEDIAN        object
H_PCT75         object
H_PCT90         object
A_PCT10         object
A_PCT25         object
A_MEDIAN        object
A_PCT75         object
A_PCT90         object
ANNUAL          object
HOURLY          object
dtype: object

In [5]:
df["OCC_TITLE"].value_counts()

Office and Administrative Support Occupations                                      395
Cashiers                                                                           395
Combined Food Preparation and Serving Workers, Including Fast Food                 395
First-Line Supervisors of Office and Administrative Support Workers                395
All Occupations                                                                    395
First-Line Supervisors of Food Preparation and Serving Workers                     395
Janitors and Cleaners, Except Maids and Housekeeping Cleaners                      395
First-Line Supervisors of Retail Sales Workers                                     395
Heavy and Tractor-Trailer Truck Drivers                                            395
Community and Social Service Occupations                                           395
Sales and Related Occupations                                                      395
Food Preparation and Serving Related Occupations                                   395
Maintenance and Repair Workers, General                                            395
Tellers                                                                            395
First-Line Supervisors of Production and Operating Workers                         395
Installation, Maintenance, and Repair Occupations                                  395
Waiters and Waitresses                                                             395
Secretaries and Administrative Assistants, Except Legal, Medical, and Executive    395
Building and Grounds Cleaning and Maintenance Occupations                          395
Bookkeeping, Accounting, and Auditing Clerks                                       395
Business and Financial Operations Occupations                                      395
Healthcare Support Occupations                                                     395
Transportation and Material Moving Occupations                                     395
Retail Salespersons                                                                395
Accountants and Auditors                                                           395
Human Resources Specialists                                                        394
Management Occupations                                                             394
Construction and Extraction Occupations                                            394
Personal Care and Service Occupations                                              394
Laborers and Freight, Stock, and Material Movers, Hand                             394
                                                                                  ...
Geographers                                                                          6
Log Graders and Scalers                                                              6
Railroad Brake, Signal, and Switch Operators                                         6
Subway and Streetcar Operators                                                       6
Radio Operators                                                                      5
Railroad Conductors and Yardmasters                                                  5
Terrazzo Workers and Finishers                                                       5
Paperhangers                                                                         5
Signal and Track Switch Repairers                                                    5
Astronomers                                                                          4
Locomotive Engineers                                                                 4
Home Economics Teachers, Postsecondary                                               4
Fallers                                                                              4
Dredge Operators                                                                     3
Industrial-Organizational Psychologists                                              3
Transit and Railroad Police                                                          3
Animal Breeders                                                                      3
Mining Machine Operators, All Other                                                  3
Mine Shuttle Car Operators                                                           2
Roof Bolters, Mining                                                                 2
Mine Cutting and Channeling Machine Operators                                        2
Refractory Materials Repairers, Except Brickmasons                                   2
Cooks, Private Household                                                             2
Loading Machine Operators, Underground Mining                                        2
Shoe Machine Operators and Tenders                                                   2
Rail Transportation Workers, All Other                                               1
Timing Device Assemblers and Adjusters                                               1
Fabric Menders, Except Garment                                                       1
Nuclear Power Reactor Operators                                                      1
Prosthodontists                                                                      1
Name: OCC_TITLE, Length: 825, dtype: int64

In [6]:
#Create a dataframe that contains the keywords we are looking to search aka analyst and analytics jobs
search_values = ["Database", "Analyst", "Analysis", "Analytic", "Statistic", "Machine Learning"]
occ_revised_df = df[df.OCC_TITLE.str.contains('|'.join(search_values ))]
occ_revised_df.head()

,PRIM_STATE,AREA,AREA_NAME,OCC_CODE,OCC_TITLE,OCC_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC QUOTIENT,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
40,AK,11260,"Anchorage, AK",13-1111,Management Analysts,detailed,410,10.0,2.362,0.50,...,43.36,51.02,65.19,"59,900","72,920","90,190","106,120","135,590",NaN,NaN
43,AK,11260,"Anchorage, AK",13-1141,"Compensation, Benefits, and Job Analysis Speci...",detailed,70,15.1,0.381,0.66,...,31.93,38.91,56.89,"47,630","55,220","66,420","80,940","118,320",NaN,NaN
45,AK,11260,"Anchorage, AK",13-1161,Market Research Analysts and Marketing Special...,detailed,200,12.6,1.182,0.27,...,31.22,43.52,53.86,"33,510","44,540","64,930","90,510","112,030",NaN,NaN
49,AK,11260,"Anchorage, AK",13-2031,Budget Analysts,detailed,120,5.0,0.725,1.99,...,38.10,43.92,50.89,"56,160","65,520","79,250","91,360","105,840",NaN,NaN
50,AK,11260,"Anchorage, AK",13-2051,Financial Analysts,detailed,220,36.4,1.274,0.60,...,40.40,54.70,67.38,"48,080","64,380","84,030","113,770","140,160",NaN,NaN

In [7]:
occ_revised_df["OCC_TITLE"].value_counts()

Market Research Analysts and Marketing Specialists      380
Management Analysts                                     373
Computer Systems Analysts                               359
Financial Analysts                                      271
Database Administrators                                 223
Compensation, Benefits, and Job Analysis Specialists    210
Information Security Analysts                           183
Credit Analysts                                         177
Operations Research Analysts                            172
Budget Analysts                                         162
Statisticians                                           104
Statistical Assistants                                   57
Broadcast News Analysts                                  25
Name: OCC_TITLE, dtype: int64

In [8]:
employment_df = occ_revised_df[["PRIM_STATE", "AREA", "AREA_NAME", "OCC_TITLE", 
                                "TOT_EMP", "JOBS_1000", "A_MEAN", "A_PCT10", "A_PCT25",
                                "A_MEDIAN", "A_PCT75", "A_PCT90"]]
employment_df = employment_df[employment_df.TOT_EMP != '**']
employment_df = employment_df[employment_df.JOBS_1000 != '**']
employment_df = employment_df[employment_df.A_MEAN != '*']
employment_df = employment_df[employment_df.A_PCT10 != '*']
employment_df = employment_df[employment_df.A_PCT25 != '*']
employment_df = employment_df[employment_df.A_MEDIAN != '*']
employment_df = employment_df[employment_df.A_PCT75 != '*']
employment_df = employment_df[employment_df.A_PCT90 != '*']
employment_df.head()

,PRIM_STATE,AREA,AREA_NAME,OCC_TITLE,TOT_EMP,JOBS_1000,A_MEAN,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90
40,AK,11260,"Anchorage, AK",Management Analysts,410,2.362,"96,540","59,900","72,920","90,190","106,120","135,590"
43,AK,11260,"Anchorage, AK","Compensation, Benefits, and Job Analysis Speci...",70,0.381,"73,150","47,630","55,220","66,420","80,940","118,320"
45,AK,11260,"Anchorage, AK",Market Research Analysts and Marketing Special...,200,1.182,"68,140","33,510","44,540","64,930","90,510","112,030"
49,AK,11260,"Anchorage, AK",Budget Analysts,120,0.725,"79,480","56,160","65,520","79,250","91,360","105,840"
50,AK,11260,"Anchorage, AK",Financial Analysts,220,1.274,"95,410","48,080","64,380","84,030","113,770","140,160"

In [9]:
employment_df['TOT_EMP'] = employment_df['TOT_EMP'].str.replace(',', '').astype(float)
employment_df['JOBS_1000'] = employment_df['JOBS_1000'].str.replace(',', '').astype(float)
employment_df['A_MEAN'] = employment_df['A_MEAN'].str.replace(',', '').astype(float)
employment_df['A_PCT10'] = employment_df['A_PCT10'].str.replace(',', '').astype(float)
employment_df['A_PCT25'] = employment_df['A_PCT25'].str.replace(',', '').astype(float)
employment_df['A_MEDIAN'] = employment_df['A_MEDIAN'].str.replace(',', '').astype(float)
employment_df['A_PCT75'] = employment_df['A_PCT75'].str.replace(',', '')
employment_df['A_PCT90'] = employment_df['A_PCT90'].str.replace(',', '')
employment_df.head()

,PRIM_STATE,AREA,AREA_NAME,OCC_TITLE,TOT_EMP,JOBS_1000,A_MEAN,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90
40,AK,11260,"Anchorage, AK",Management Analysts,410.0,2.362,96540.0,59900.0,72920.0,90190.0,106120,135590
43,AK,11260,"Anchorage, AK","Compensation, Benefits, and Job Analysis Speci...",70.0,0.381,73150.0,47630.0,55220.0,66420.0,80940,118320
45,AK,11260,"Anchorage, AK",Market Research Analysts and Marketing Special...,200.0,1.182,68140.0,33510.0,44540.0,64930.0,90510,112030
49,AK,11260,"Anchorage, AK",Budget Analysts,120.0,0.725,79480.0,56160.0,65520.0,79250.0,91360,105840
50,AK,11260,"Anchorage, AK",Financial Analysts,220.0,1.274,95410.0,48080.0,64380.0,84030.0,113770,140160

In [10]:
employmentgrouped_df = employment_df.groupby("AREA_NAME")

In [11]:
groupedsum = employmentgrouped_df["TOT_EMP"].sum()
jobs1000sum = employmentgrouped_df["JOBS_1000"].sum()
areamean = employmentgrouped_df["A_MEAN"].mean()

In [12]:
#Dataframe of total employment, available jobs, and annual salary averages by city.
employmentsummary_df = pd.DataFrame({"Total Employment": groupedsum,
                                    "Available Jobs (Per 1000)" : jobs1000sum,
                                    "Annual Salary Average" : areamean})
employmentsummary_df.head()

,Total Employment,Available Jobs (Per 1000),Annual Salary Average
AREA_NAME,,,
"Abilene, TX",160.0,2.510,62223.333333
"Aguadilla-Isabela, PR",140.0,3.086,50570.000000
"Akron, OH",5480.0,16.713,71915.000000
"Albany, GA",310.0,5.255,66270.000000
"Albany, OR",60.0,1.385,58610.000000

In [13]:
employmentsummary_df.sort_values(by='Annual Salary Average', ascending=False).head()

,Total Employment,Available Jobs (Per 1000),Annual Salary Average
AREA_NAME,,,
"Odessa, TX",160.0,2.083,129275.000000
"Victoria, TX",40.0,0.910,126080.000000
"Bridgeport-Stamford-Norwalk, CT",12450.0,29.946,109737.000000
"San Francisco-Oakland-Hayward, CA",79860.0,33.018,104240.833333
"New York-Newark-Jersey City, NY-NJ-PA",263480.0,27.739,102476.923077

In [14]:
stategrouped_df = employment_df.groupby("PRIM_STATE")

In [15]:
stateempsum = stategrouped_df["TOT_EMP"].sum()
statejobs1000sum = stategrouped_df["JOBS_1000"].sum()
statesalarymean = stategrouped_df["A_MEAN"].mean()

In [16]:
#Dataframe of total employment, available jobs, and annual salary averages by state.
statesummary_df = pd.DataFrame({"Total Employment": stateempsum,
                                    "Available Jobs (Per 1000)" : statejobs1000sum,
                                    "Annual Salary Average" : statesalarymean})
statesummary_df.head()

            Total Employment  Available Jobs (Per 1000)  Annual Salary Average
PRIM_STATE
AK                    1940.0                     16.668           81885.384615
AL                   17190.0                     78.462           74112.264151
AR                   16080.0                     71.224           65439.428571
AZ                   53080.0                     72.655           75219.250000
CA                  360310.0                    336.337           84469.438776

In [ ]:
statesummary_df.sort_values(by='Annual Salary Average', ascending=False).head(15)